### Задание 1

In [ ]:
import pandas as pd

In [12]:
data = pd.read_csv('ratings.csv')
data.head()

   userId  movieId  rating   timestamp
0       1      296     5.0  1147880044
1       1      306     3.5  1147868817
2       1      307     5.0  1147868828
3       1      665     5.0  1147878820
4       1      899     3.5  1147868510

In [11]:
data[data.rating == 5.0].filter(items = ['movieId', 'rating']).value_counts().head(1)

movieId  rating
318      5.0       39553
dtype: int64

### Задание 2

In [14]:
power = pd.read_csv('power.csv')
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [65]:
query_str = '''(country==\'Lithuania\' or  country==\'Latvia\' or country==\'Estonia\') and (category == 4 and category == 12 or category == 21) and (year >=2005 and year <= 2010) and quantity > 0'''

In [67]:

power.query(query_str)['quantity'].sum()

234208.0

### Задание 3

In [69]:
page_url ='https://disp.ua.energy/Blocksf/'
df = pd.read_html(page_url, attrs = {'class': 'aMain'})

In [71]:
# ! Очень интересует вопрос возможно ли с помощью пандоса вытаскивать цвет ячеек в таблице? я парсила эту табличку просто питоном, да это дольше, но там я могу вытащить все цветовые поля и сопоставить им значения из таблицы внизу, может у пандоса есть какие-то гениальные трюки? 
df

[   Станція Скл.   Сум       1       2       3       4       5       6      7  \
 0     РАЕС  1+1  1440     NaN   427.0     NaN  1013.0     NaN     NaN    NaN
 1     ЗАЕС    5  5085     NaN  1023.0  1023.0  1013.0  1003.0  1023.0    NaN
 2    ЮУАЕС    2  2056  1028.0  1028.0     NaN     NaN     NaN     NaN    NaN
 3     ХАЕС    1  1010  1010.0     NaN     NaN     NaN     NaN     NaN    NaN
 4    ЛуТЕС    3   415     NaN     NaN     NaN     NaN     NaN     NaN    NaN
 5    СлТЕС  0.5    36     NaN     NaN    36.0     NaN     NaN     NaN    NaN
 6   ВугТЕС  3+0   798     NaN   266.0   268.0   264.0     NaN     NaN    NaN
 7    КуТЕС    7  1150     NaN     NaN   126.0   127.0   192.0   191.0  174.0
 8    КрТЕС    2   421     NaN     NaN   205.0     NaN     NaN     NaN    NaN
 9    ПдТЕС  2+0   216     NaN     NaN     NaN     NaN     NaN     NaN    NaN
 10   ЗаТЕС  2+0   274    42.0     NaN     NaN   232.0     NaN     NaN    NaN
 11   ЗмТЕС  5+0   703     NaN   135.0   135.0   129.0   154.0   150.0    NaN
 12  ХТЕЦ-5  2+1   465   107.0   110.0   248.0     NaN     NaN     NaN    NaN
 13   ТрТЕС  2+0   470   259.0     NaN     NaN   211.0     NaN     NaN    NaN
 14  КТЕЦ-5  2+1   452   100.0   100.0   252.0     NaN     NaN     NaN    NaN
 15  КТЕЦ-6    2   480   249.0   231.0     NaN     NaN     NaN     NaN    NaN
 16  ЛадТЕС    3   654   242.0   206.0   206.0     NaN     NaN     NaN    NaN
 17   БуТЕС    7   864     NaN     NaN     NaN   121.0   110.0     NaN    NaN
 18  ДобТЕС  2+1   312     NaN     NaN     NaN     NaN    74.0    84.0    NaN

         8      9     10     11     12     13     14  15
 0     NaN    NaN    NaN    NaN    NaN    NaN    NaN NaN
 1     NaN    NaN    NaN    NaN    NaN    NaN    NaN NaN
 2     NaN    NaN    NaN    NaN    NaN    NaN    NaN NaN
 3     NaN    NaN    NaN    NaN    NaN    NaN    NaN NaN
 4     NaN    NaN  141.0    NaN    NaN  142.0  132.0 NaN
 5     NaN    NaN    NaN    NaN    NaN    NaN    NaN NaN
 6     NaN    NaN    NaN    NaN    NaN    NaN    NaN NaN
 7   166.0  174.0    NaN    NaN    NaN    NaN    NaN NaN
 8     NaN    NaN  216.0    NaN    NaN    NaN    NaN NaN
 9     NaN  105.0  111.0    NaN    NaN    NaN    NaN NaN
 10    NaN    NaN    NaN    NaN    NaN    NaN    NaN NaN
 11    NaN    NaN    NaN    NaN    NaN    NaN    NaN NaN
 12    NaN    NaN    NaN    NaN    NaN    NaN    NaN NaN
 13    NaN    NaN    NaN    NaN    NaN    NaN    NaN NaN
 14    NaN    NaN    NaN    NaN    NaN    NaN    NaN NaN
 15    NaN    NaN    NaN    NaN    NaN    NaN    NaN NaN
 16    NaN    NaN    NaN    NaN    NaN    NaN    NaN NaN
 17  119.0  137.0  121.0  115.0  141.0    NaN    NaN NaN
 18  154.0    NaN    NaN    NaN    NaN    NaN    NaN NaN  ]